[
    { "category": "animals", "title": "Elephant", "text": "Elephants are the largest land mammals with distinctive trunks containing over 40,000 muscles enabling precise manipulation and remarkable tactile sensitivity. These intelligent herbivores live in matriarchal herds across African savannas and Asian forests, communicating through infrasonic rumbles below human hearing that travel up to 10 kilometers. Their exceptional memory enables recognition of hundreds of individuals and routes to seasonal water sources decades later. Complex social bonds include mourning rituals for deceased herd members, playful interactions, and cooperative childcare, displaying emotional depth and empathy rare among non-primates." },
    { "category": "animals", "title": "Dolphin", "text": "Dolphins are highly intelligent cetaceans living in pods throughout ocean waters worldwide, possessing brains as complex and proportionally large as humans. They communicate using sophisticated clicks, whistles, and body language while displaying self-awareness in mirror tests and complex problem-solving abilities rivaling primates. These playful creatures use echolocation to coordinate cooperative hunts with remarkable precision, herding fish into bait balls. Their curiosity toward humans, occasional rescue behaviors of drowning swimmers, and capacity for joy through surfing waves remain scientifically intriguing." },
    { "category": "animals", "title": "Eagle", "text": "Eagles are majestic birds of prey soaring on powerful wings with wingspans exceeding two meters, capable of carrying prey weighing up to 8 kilograms. Their exceptional eyesight is eight times sharper than human vision, with two focal points per eye enabling simultaneous wide-angle and telescopic viewing to spot prey from kilometers while using thermal updrafts for energy-efficient flight. These apex predators hunt fish, rabbits, and small animals using talons exerting over 500 pounds of pressure per square inch. Bald eagles mate for life, returning to the same massive nests year after year, and can live over 50 years in the wild." },
    { "category": "animals", "title": "Lion", "text": "Lions are muscular big cats living in social groups called prides across African grasslands, unique among cats for their collective living arrangements of 4-30 individuals. Males sport magnificent manes whose darkness correlates with testosterone levels and overall health, while females perform most hunting using sophisticated cooperative strategies and complex vocalizations to coordinate attacks. Known as kings of the savanna, lions produce thunderous roars reaching 114 decibels to defend territory, audible over 8 kilometers away. A successful pride can consume 70 kilograms of meat in a single feeding session after coordinated hunts." },
    { "category": "animals", "title": "Penguin", "text": "Penguins are flightless seabirds perfectly adapted to marine life in cold southern hemisphere waters, swimming at speeds exceeding 30 kilometers per hour underwater. Their streamlined torpedo-shaped bodies and flipper-like wings make them excellent hunters of fish and krill, while distinctive counter-shading camouflage protects them from predators above and below. These highly social birds form massive breeding colonies of thousands, with emperor penguins enduring Antarctic winters by huddling together in coordinated rotating formations, taking turns at the warm center. Males famously incubate eggs on their feet for two months without eating during brutal polar darkness." },
    { "category": "animals", "title": "Whale", "text": "Whales are the largest animals ever to exist on Earth, with blue whales reaching 30 meters in length and weighing up to 200 tons while feeding primarily on tiny krill. These highly intelligent marine mammals migrate thousands of kilometers annually across ocean basins, with humpbacks traveling up to 8,000 kilometers between feeding and breeding grounds. They communicate through complex haunting songs traveling hundreds of kilometers through water, with males singing elaborate compositions lasting up to 30 minutes. Different species employ specialized feeding strategies: baleen whales filter-feed using curtain-like plates, while toothed whales hunt large fish and squid in coordinated pods." },
    { "category": "animals", "title": "Tiger", "text": "Tigers are powerful striped apex predators with orange and black coats unique to each individual like human fingerprints, stalking Asian jungles and grasslands as solitary hunters. These muscular cats weighing up to 300 kilograms use vertical camouflage stripes to ambush prey like deer and wild boar, killing with precise neck bites rather than suffocation like other big cats. As excellent swimmers unlike most felines, tigers not only cool off in water but actively hunt aquatic prey including fish and even small crocodiles, swimming across rivers up to 6 kilometers wide during territorial movements. Their roar can be heard 3 kilometers away, and they can leap 10 meters horizontally." },
    { "category": "animals", "title": "Octopus", "text": "Octopuses are remarkably intelligent cephalopods with eight flexible arms lined with hundreds of suction cups capable of independent movement and sophisticated object manipulation. These masters of camouflage possess specialized chromatophore cells enabling instant color and texture changes to blend seamlessly with surroundings or communicate emotional states through color waves across their bodies. Their distributed nervous system contains two-thirds of their 500 million neurons in their arms, allowing independent problem-solving, tool use, and escape from complex puzzles. Octopuses can squeeze through any opening larger than their beak, and some species use coconut shells as portable shelters, demonstrating remarkable intelligence." },
    { "category": "animals", "title": "Giraffe", "text": "Giraffes are the tallest land animals reaching heights of 5.5 meters with necks up to 2 meters long, containing just seven vertebrae like humans but each one elongated. Their distinctive spotted coat patterns are unique identifiers like fingerprints, providing camouflage in dappled savanna light. These herbivores use 45-centimeter prehensile tongues to strip acacia leaves other animals cannot reach, while their specialized cardiovascular system prevents blackouts when lowering heads to drink. Despite their height, giraffes can run 55 kilometers per hour and deliver devastating kicks capable of killing lions." },
    { "category": "animals", "title": "Shark", "text": "Sharks are ancient cartilaginous fish that have dominated oceans for over 400 million years, predating dinosaurs with specialized hunting adaptations perfected through evolution. Their extraordinary sense of smell detects one drop of blood in 100 liters of water from over a kilometer away, while ampullae of Lorenzini electroreceptors sense electrical fields from prey muscle contractions. These apex predators range from massive 6-meter great whites to tiny dwarf lanternsharks fitting in a hand. Sharks must keep swimming to breathe, lack bones entirely, and continuously replace thousands of teeth throughout their lives." },
    { "category": "animals", "title": "Gorilla", "text": "Gorillas are gentle giants and the largest living primates, sharing 98.3 percent of human DNA and living in African rainforest family groups of 5-30 individuals. These powerful herbivores consume up to 18 kilograms of vegetation daily, led by dominant silverback males weighing up to 220 kilograms who protect their troops fiercely. Their remarkable intelligence manifests in tool use like branch testing for water depth, sign language acquisition of over 1,000 signs, and complex emotional expressions including laughter and grief. Despite their intimidating size and strength ten times greater than humans, gorillas are predominantly peaceful vegetarians." },
    { "category": "animals", "title": "Owl", "text": "Owls are nocturnal raptors with exceptional hearing capable of locating prey in complete darkness using asymmetrical ear positions that triangulate sound sources precisely. Their specialized wing feathers with soft fringed edges allow virtually silent flight while hunting small mammals and birds, approaching prey undetected. These mysterious birds rotate their heads up to 270 degrees in each direction due to unique bone structures and blood vessel reservoirs preventing stroke. With binocular vision and eyes fixed in sockets, owls have developed extraordinary neck flexibility. Some species can hear mice moving under snow from 30 meters away." },
    { "category": "animals", "title": "Cheetah", "text": "Cheetahs are the fastest land animals reaching speeds exceeding 110 kilometers per hour in explosive three-second acceleration bursts, using their incredibly flexible spine like a spring. These slender spotted cats have distinctive black tear marks reducing sun glare during African savanna hunts while their semi-retractable claws provide traction like running spikes. Unlike other big cats, cheetahs cannot roar due to fixed hyoid bones but instead chirp, purr, and even meow like house cats. Their lightweight build prioritizes speed over strength, forcing them to hunt during daytime to avoid larger nocturnal predators that steal their kills." },
    { "category": "animals", "title": "Koala", "text": "Koalas are tree-dwelling marsupials from Australia sleeping up to 22 hours daily to conserve energy from their extremely low-nutrition eucalyptus diet providing minimal calories. These fuzzy gray mammals possess fingerprints remarkably similar to humans, so identical that forensic experts cannot distinguish them under microscopes. They can safely digest toxic eucalyptus leaves containing cyanide compounds that would kill other animals, thanks to specialized digestive systems and detoxifying liver enzymes. Mothers carry blind, hairless joeys weighing less than one gram in pouches for six months, then piggyback them for another six months while teaching them which eucalyptus species to eat." },
    { "category": "animals", "title": "Polar Bear", "text": "Polar bears are the largest land carnivores weighing up to 800 kilograms, perfectly adapted to Arctic life with water-repellent hollow fur providing insulation and buoyancy, while black skin absorbs heat beneath. These powerful swimmers can paddle at 10 kilometers per hour for days, covering over 600 kilometers across open ocean between ice floes. They hunt ringed seals primarily at breathing holes, waiting motionless for hours before explosive attacks using their 1,500-kilogram bite force. Climate change critically threatens their survival as melting sea ice reduces hunting platforms, forcing longer swims that exhaust bears and drown cubs." },
    { "category": "animals", "title": "Flamingo", "text": "Flamingos are vibrant pink wading birds getting their distinctive coloration from carotenoid pigments in shrimp and algae they filter-feed, with brighter colors indicating healthier individuals. These highly social birds live in massive synchronized flocks numbering up to one million, performing coordinated group displays during courtship rituals. They often stand on one leg to conserve body heat and reduce muscle fatigue, a behavior still debated by scientists. Their uniquely curved beaks contain comb-like lamellae filters allowing them to feed upside down, pumping muddy water through while trapping tiny organisms. Flamingos can drink boiling water from geysers and survive in caustic alkaline lakes that would burn other animals." },
    { "category": "animals", "title": "Panda", "text": "Giant pandas are iconic black and white bears from Chinese mountain bamboo forests, consuming up to 38 kilograms of bamboo daily for 12-16 hours of feeding time. These critically endangered mammals possess pseudo-thumbs, actually modified wrist bones helping them grip bamboo stalks precisely while sitting upright like humans. Despite their specialized herbivorous diet of 99% bamboo, pandas retain inefficient carnivore digestive systems extracting only 17% of bamboo nutrients, occasionally supplementing with eggs, small animals, or carrion. Their distinctive coloring may provide camouflage in snowy, rocky habitats while their solitary nature and low reproduction rates contribute to endangerment." },
    { "category": "animals", "title": "Kangaroo", "text": "Kangaroos are powerful marsupials hopping across Australian outback using massive hind legs and muscular tails acting as third legs for balance and propulsion. These herbivores can leap eight meters horizontally and three meters high in single bounds, reaching speeds of 70 kilometers per hour while using less energy than four-legged running. Females possess remarkable reproductive adaptation called embryonic diapause, pausing embryo development during droughts. They carry bean-sized underdeveloped joeys in pouches for 8-9 months, nursing them with milk that changes composition as joeys grow, before teaching independence through gradual weaning." },
    { "category": "animals", "title": "Crocodile", "text": "Crocodiles are ancient reptilian predators unchanged for 200 million years, with immensely powerful jaws exerting over 3,700 pounds of pressure per square inch, strongest of any animal. These cold-blooded ambush hunters lurk motionless in tropical rivers and wetlands for hours, then explosively launch from water at speeds exceeding 40 kilometers per hour to catch prey. Their armored osteoderms (bony scales) provide protection while specialized palatal valves allow breathing with mouths open underwater. Crocodiles can hold their breath for over an hour, regulate body temperature through basking, and engage in surprisingly gentle parental care, carrying hatchlings in their mouths." },
    { "category": "animals", "title": "Parrot", "text": "Parrots are highly intelligent colorful birds with powerful curved beaks capable of cracking nuts, zygodactyl feet (two toes forward, two back) for climbing, and impressive vocal mimicry abilities rivaling human speech through specialized syrinx vocal organs. These social tropical birds live in flocks up to hundreds, forming lifelong monogamous pairs while demonstrating problem-solving intelligence comparable to five-year-old children. Many of the 350+ species face critical endangerment from rainforest habitat destruction and illegal pet trade. Some species like African Greys can learn over 100 words and understand concepts like colors and shapes." },
    { "category": "animals", "title": "Wolf", "text": "Wolves are highly social carnivores hunting cooperatively in packs of 5-10 individuals with complex hierarchies led by breeding alpha pairs who are typically the only reproducers. These direct ancestors of all domestic dogs communicate through howls audible 10 kilometers away, subtle body language, facial expressions, and scent marking across territories spanning 1,000 square kilometers. Their sophisticated pack coordination enables taking down prey five times their size like moose and bison through strategic flanking and relay tactics. Wolves can travel 60 kilometers daily, consume 9 kilograms of meat in one sitting, and play crucial ecosystem roles controlling prey populations." },
    { "category": "animals", "title": "Seal", "text": "Seals are streamlined marine mammals with torpedo-shaped bodies and flippers perfectly adapted for swimming up to 40 kilometers per hour in cold ocean waters while hauling out to bask on rocky shores and ice. These carnivores hunt fish, squid, and krill underwater, holding their breath for up to two hours during dives exceeding 600 meters deep. Their thick blubber layer up to 10 centimeters provides crucial insulation against frigid Arctic and Antarctic waters while their large eyes adapted for low-light enable hunting in dark depths. Mother seals identify their pups among thousands through unique vocalizations and scent." },
    { "category": "animals", "title": "Butterfly", "text": "Butterflies are delicate insects with four wings covered in thousands of microscopic scales creating vibrant iridescent patterns, undergoing complete metamorphosis from crawling caterpillar to chrysalis to flying adult over weeks. These crucial pollinators use coiled proboscis tongues to sip flower nectar while inadvertently transferring pollen between plants, supporting ecosystem biodiversity. Their elaborate wing patterns serve multiple functions: attracting mates through UV-reflective scales, warning predators of toxicity through bright aposematic coloration, and providing camouflage when wings close. Some species like Monarchs migrate up to 5,000 kilometers annually across generations using internal magnetic compasses." },
    { "category": "animals", "title": "Jellyfish", "text": "Jellyfish are ancient gelatinous marine animals existing for over 500 million years, drifting through oceans propelled by rhythmic bell contractions while being 95% water. These deceptively simple creatures lack brains, hearts, bones, or blood yet successfully hunt using tentacles armed with thousands of stinging nematocyst cells containing coiled venomous harpoons that fire in under a millisecond when triggered. Some species like box jellyfish deliver venom deadly to humans, while others glow bioluminescent in dark ocean depths through chemical reactions. The immortal jellyfish can reverse its aging process, theoretically living forever by reverting to polyp stage." },
    { "category": "animals", "title": "Zebra", "text": "Zebras are distinctive striped equines with black and white coats creating unique patterns like human fingerprints, serving both individual identification and predator confusion through motion dazzle when herds stampede. These African grazers live in social groups called harems led by stallions protecting 5-6 mares, constantly migrating thousands of kilometers annually to find fresh grass and water sources. Their powerful rear-leg kicks can deliver blows exceeding 1,300 kilograms of force, capable of breaking lions' jaws or killing attacking hyenas. Zebras have excellent eyesight and hearing, can run 65 kilometers per hour, and their striping may also deter biting flies." },
    { "category": "animals", "title": "Bee", "text": "Bees are crucial pollinating insects living in highly organized colonies of up to 80,000 individuals with queens, sterile female workers, and male drones following complex social hierarchies and division of labor. These fuzzy flyers produce honey as food stores and beeswax for comb construction while individual foragers visit up to 5,000 flowers daily, transferring pollen that enables one-third of human food production. Their remarkable waggle dance communicates precise food source locations including distance and direction relative to the sun through figure-eight movements. Honeybees can recognize human faces, make collective democratic decisions, and their disappearance through colony collapse disorder threatens global agriculture." },
    { "category": "animals", "title": "Rhinoceros", "text": "Rhinoceroses are massive herbivores with thick armored skin up to 5 centimeters deep and prominent horns made entirely of keratin (like hair and nails), not bone, growing continuously throughout their lives. These critically endangered prehistoric-looking giants from Africa and Asia can weigh over 2,300 kilograms yet charge at speeds reaching 55 kilometers per hour despite their bulk. White rhinos are actually gray, named from Afrikaans word wijde meaning wide-mouthed. Catastrophic poaching for horns falsely believed to have medicinal properties has reduced populations to near-extinction, with northern white rhinos functionally extinct with only two females remaining." },
    { "category": "animals", "title": "Seahorse", "text": "Seahorses are unique marine fish swimming upright using rapid dorsal fin oscillations up to 35 times per second for propulsion and tiny pectoral fins for steering and stability. In an extraordinary biological rarity among vertebrates, male seahorses become pregnant, carrying developing embryos in specialized brood pouches for 2-4 weeks after elaborate courtship dances where females transfer up to 1,500 eggs. Their prehensile monkey-like tails grip seagrass and coral while camouflaged bony-plated bodies remain motionless, ambushing tiny crustaceans by sucking them through tubular snouts. Seahorses mate for life, change colors to communicate mood, and some species are smaller than a fingernail." },
    { "category": "animals", "title": "Hummingbird", "text": "Hummingbirds are the smallest birds weighing as little as 2 grams, with hearts beating up to 1,200 times per minute and wings flapping 80 times per second creating the distinctive humming sound. These incredible aerial acrobats can hover motionless, fly backwards, sideways, and even upside down while feeding on flower nectar using extendable forked tongues. Their extreme metabolism requires visiting 1,000-2,000 flowers daily, consuming more than their body weight in nectar and doubling body mass before migration. Ruby-throated hummingbirds migrate 800 kilometers non-stop across the Gulf of Mexico. They can remember every flower visited and enter torpor at night, lowering metabolism by 95% to survive." },
    { "category": "animals", "title": "Bat", "text": "Bats are the only truly flying mammals, representing 20% of all mammal species worldwide and navigating darkness using sophisticated echolocation, emitting ultrasonic calls up to 200 times per second while listening for echoes bouncing off objects. These nocturnal creatures include insectivores consuming up to 1,200 mosquitoes hourly, fruit-eaters dispersing rainforest seeds, and blood-feeding vampire species sharing food with hungry colony members. Despite scary reputation, bats provide crucial ecosystem services: pollinating agave for tequila, dispersing seeds for rainforest regeneration, and controlling agricultural pest populations worth billions annually. Some species live over 40 years and can fly at 160 kilometers per hour." },
    { "category": "animals", "title": "Fox", "text": "Foxes are clever canines with luxurious bushy tails and distinctive pointed ears, successfully adapting to diverse habitats from Arctic tundra to Sahara desert and thriving in urban environments worldwide. These omnivorous hunters catch rodents using remarkable pouncing technique called mousing, leaping up to 2 meters high before diving nose-first to pin prey with front paws. Their reputation for cunning stems from exceptional problem-solving abilities, opportunistic feeding on everything from insects to fruits, and capacity to remember thousands of food cache locations. Red foxes use Earth magnetic field to hunt, have over 40 different vocalizations, and live in underground dens called earths with multiple escape tunnels." },
    { "category": "animals", "title": "Turtle", "text": "Turtles are ancient reptiles existing for over 200 million years, protected by hard shells composed of 60 bone plates covered in keratin scutes, functionally modified rib cages permanently fused to their spines. These remarkably long-lived animals can survive over 150 years, with some Galápagos tortoises exceeding 175 years. Sea turtles navigate thousands of kilometers across oceans using Earth magnetic field, returning to exact natal beaches for nesting decades later. Their shells cannot be removed without killing them since ribs and vertebrae are integrated. Some species can breathe through their cloaca (butt-breathing) allowing them to stay underwater for months during hibernation." },
    { "category": "animals", "title": "Otter", "text": "Otters are playful aquatic mammals possessing the densest fur of any animal with up to one million hairs per square inch, creating waterproof insulation and webbed feet for swimming up to 11 kilometers per hour. These intelligent carnivores use rocks as anvils on their chests to crack open shellfish and sea urchins, demonstrating sophisticated tool use. They form social groups called rafts of up to 100 individuals, floating on backs while grooming, eating, and holding hands to avoid drifting apart while sleeping. Sea otters consume 25% of their body weight daily in seafood, play crucial roles controlling sea urchin populations protecting kelp forests, and are one of few animals using tools." },
    { "category": "animals", "title": "Peacock", "text": "Peacocks are male peafowl displaying spectacular iridescent tail feathers up to 2 meters long covered with eye spots called ocelli in elaborate courtship rituals to attract peahens. These large ornamental pheasants can spread tail trains containing over 200 feathers in impressive fan displays while vibrating them to create infrasonic rumbling below human hearing. Native to India and Southeast Asia, they roost in trees at night for protection and eat insects, seeds, small snakes, and rodents. Their brilliant coloring comes from microscopic crystal structures creating iridescence, not pigments. Peacocks shed and regrow their magnificent trains annually after mating season." },
    { "category": "animals", "title": "Squirrel", "text": "Squirrels are agile tree-dwelling rodents with luxurious bushy tails providing balance during acrobatic leaps up to 6 meters between branches and acting as parachutes during falls. These prolific hoarders gather and bury thousands of nuts annually across territories, remembering cache locations through sophisticated spatial memory and even organizing nuts by species and quality. Their remarkable ability to rotate ankles 180 degrees allows headfirst descent down tree trunks using sharp claws. Squirrels can fall from 30 meters without injury, contribute to forest growth by forgetting cached nuts that sprout into trees, and their teeth never stop growing throughout their lives." },
    { "category": "animals", "title": "Salamander", "text": "Salamanders are amphibians with lizard-like appearance living in moist habitats near streams, under logs, and in caves across temperate regions. These remarkable creatures possess extraordinary regenerative abilities, regrowing lost limbs, tails, jaws, spinal cords, and even portions of organs including hearts, eyes, and brains without scarring. Most species undergo metamorphosis from aquatic gill-breathing larvae to terrestrial adults breathing through permeable skin and rudimentary lungs. Some species like axolotls remain aquatic throughout life in neotenic form. Salamanders range from tiny 2-centimeter species to giant Chinese salamanders exceeding 1.8 meters, the largest amphibians on Earth." },
    { "category": "animals", "title": "Moose", "text": "Moose are the largest deer species weighing up to 700 kilograms with massive broad palmate antlers spanning up to 2 meters wide and weighing 30 kilograms worn only by males. These solitary herbivores inhabit northern boreal forests and wetlands across North America and Eurasia, feeding on aquatic plants, tree bark, leaves, and shrubs consuming 30 kilograms daily. Bulls shed and regrow their enormous antlers annually at growth rates exceeding 2 centimeters per day, one of nature fastest tissue growth processes. Moose are excellent swimmers capable of diving 6 meters deep for aquatic vegetation, can run 55 kilometers per hour despite their bulk, and their long legs allow walking through deep snow." },
    { "category": "animals", "title": "Chameleon", "text": "Chameleons are specialized lizards famous for changing skin color through chromatophore cells containing nanocrystals that reflect different wavelengths, primarily for communication, mood expression, and temperature regulation rather than camouflage. Their independently moving eyes provide 360-degree vision with each eye scanning separately for insects, which they capture using projectile tongues accelerating at 41 G-forces extending twice their body length in 0.07 seconds. These arboreal reptiles move slowly and deliberately using prehensile tails for gripping branches, zygodactyl feet for climbing, and rocking gaits mimicking leaves swaying. Some species can see ultraviolet light, and the smallest chameleons measure just 15 millimeters long." },
    { "category": "animals", "title": "Sloth", "text": "Sloths are extraordinarily slow-moving mammals spending entire lives hanging upside down in Central and South American rainforest canopies, moving at maximum speeds of 0.27 kilometers per hour. Their deliberate movements and algae-covered fur growing in reverse direction (from belly to back) provide perfect camouflage from predators like harpy eagles and jaguars while creating symbiotic ecosystems hosting moths and algae. These remarkably energy-efficient animals have metabolisms 40-45% slower than similar-sized mammals, three-toed hearts beating 40-50 times per minute, and descend from trees only once weekly for risky bathroom breaks. They can rotate heads 270 degrees, are excellent swimmers, and can hold their breath for 40 minutes." },
    { "category": "animals", "title": "Lobster", "text": "Lobsters are marine crustaceans with asymmetrical claws specialized for different functions: one larger crusher claw for breaking shells and one smaller pincer claw for tearing soft tissue, scavenging ocean floors for fish, mollusks, and algae. These invertebrates can live over 100 years showing negligible senescence, continuously growing throughout life by molting exoskeletons up to 25 times in first 5-7 years. Their blue blood contains copper-based hemocyanin instead of iron-based hemoglobin for oxygen transport. Lobsters communicate by peeing at each other from nozzles on their faces, can regenerate lost limbs, and were once so abundant they were fed to prisoners and considered poverty food." },
    { "category": "animals", "title": "Ant", "text": "Ants are incredibly strong social insects living in highly organized colonies of up to 20 million individuals following complex pheromone chemical communication and strict division of labor among queens, workers, and soldiers. These tiny powerhouses can carry objects 50 times their body weight, with leafcutter ants farming sophisticated fungus gardens and others herding aphids like livestock for honeydew secretions. Some species form living bridges and rafts by linking their bodies together during floods, while army ants conduct massive coordinated raids. Ants have colonized almost every landmass on Earth, comprise 15-20% of terrestrial animal biomass, and have been around for over 100 million years." },
    { "category": "animals", "title": "Frog", "text": "Frogs are tailless amphibians undergoing dramatic metamorphosis from aquatic gill-breathing tadpoles to adult forms, breathing through permeable skin absorbing oxygen and supplementary lungs. These extraordinarily vocal animals produce species-specific calls to attract mates using inflatable vocal sacs that amplify croaks, chirps, and trills audible over a kilometer away. Their powerful muscular hind legs enable jumping up to 20 times their body length, escaping predators and catching flying insects with lightning-fast sticky extensible tongues. Some species like poison dart frogs secrete deadly toxins through skin, while glass frogs have transparent bellies revealing internal organs." },
    { "category": "animals", "title": "Snake", "text": "Snakes are elongated legless reptiles with extremely flexible bodies covered in protective overlapping scales, sensing prey through ground vibrations, heat-detecting pit organs in vipers, and chemical detection using forked tongues sampling air particles delivered to Jacobson organ. Venomous species like cobras and vipers inject potent neurotoxic or hemotoxic toxins through specialized hollow fangs, while constrictors like pythons and boas squeeze prey cutting off blood circulation. These obligate carnivores swallow prey whole using incredibly flexible jaw joints with independent quadrate bones allowing mouths to open 150 degrees. Some species can go months without eating after large meals." },
    { "category": "animals", "title": "Crab", "text": "Crabs are decapod crustaceans with hard calcium carbonate exoskeletons and powerful asymmetrical pincers, characteristically scuttling sideways across beaches, reefs, and ocean floors using specialized leg joints. These adaptable omnivorous scavengers eat algae, mollusks, worms, and detritus while molting their entire shells periodically to grow larger, becoming extremely vulnerable during soft-shell periods when hiding for protection. Many species like Christmas Island red crabs migrate in massive synchronized congregations of millions traveling kilometers between forest homes and ocean breeding grounds. Some crabs live in shells, others climb trees, and coconut crabs can crack coconuts with claws exerting 3,300 newtons of force." },
    { "category": "animals", "title": "Spider", "text": "Spiders are eight-legged arachnids with two body segments spinning intricate silk webs from specialized spinnerets producing protein fibers with tensile strength stronger than steel and elasticity exceeding nylon. These efficient predators inject venom and digestive enzymes through hollow fangs into prey, liquefying internals before consuming the nutritious soup. Despite widespread arachnophobia they inspire, spiders provide crucial pest control eating 400-800 million tons of insects annually, and of 45,000 species, fewer than 30 pose danger to humans. Some species like jumping spiders have excellent vision and complex hunting strategies, while tarantulas can live over 30 years." },
    { "category": "animals", "title": "Hawk", "text": "Hawks are versatile medium-sized birds of prey with sharp curved talons exerting crushing force and exceptional vision eight times sharper than humans, capable of spotting field mice from 30 meters high while soaring. These opportunistic aerial hunters use thermal updrafts for energy-efficient soaring while scanning grasslands, forests, and deserts for rabbits, squirrels, snakes, and large insects. Their powerful gripping talons can exceed 200 pounds per square inch pressure, while hooked beaks efficiently tear prey into manageable pieces. Red-tailed hawks are most common North American raptors, often seen perched on roadside poles or circling overhead with distinctive screaming calls." },
    { "category": "animals", "title": "Pelican", "text": "Pelicans are large aquatic birds with enormous expandable throat pouches made of distensible skin holding up to 13 liters of water, three times their stomach capacity, for scooping fish during feeding. These skilled cooperative fishers dive from heights up to 20 meters or skim water surfaces in coordinated groups, herding fish into shallow areas for easier catching. Their fully webbed feet with all four toes connected, waterproof feathers, and air sacs under skin provide excellent buoyancy for swimming in coastal and inland waters. Brown pelicans dive spectacularly while white pelicans fish cooperatively, and their bills can hold more than their bellies can." },
    { "category": "animals", "title": "Swan", "text": "Swans are elegant large water birds with gracefully curved S-shaped necks containing 23-25 vertebrae enabling underwater feeding, living in monogamous pairs bonding for life on lakes, rivers, and wetlands. These heavy waterfowl weighing up to 15 kilograms are surprisingly aggressive and territorial, defending nests and cygnets with powerful wing beats capable of breaking human bones. Their predominantly white plumage in most species requires extensive daily preening using oil secreted from uropygial glands for waterproofing. Swans can fly at speeds exceeding 95 kilometers per hour during migration, trumpeter swans being North America heaviest flying birds." },
    { "category": "animals", "title": "Falcon", "text": "Falcons are aerodynamic raptors achieving the fastest speeds of any animal, with peregrine falcons diving at breathtaking 389 kilometers per hour to strike prey mid-flight with devastating impact. Their specialized bony tubercles (nostril baffles) direct powerful airflow away from nostrils preventing lung damage during high-speed descents, while nictitating membranes protect eyes. These precise hunters with exceptional vision and aerial agility have been used in falconry for over 4,000 years across cultures from Mongolia to medieval Europe. Peregrine falcons inhabit every continent except Antarctica, adapting to diverse environments from Arctic tundra to urban skyscrapers where they hunt pigeons." },
    { "category": "animals", "title": "Hyena", "text": "Hyenas are misunderstood carnivores with bone-crushing jaws exerting 1,100 PSI, powerful enough to crack elephant bones and consume every part of carcasses other predators leave behind. Actually skilled cooperative hunters killing 60-95% of their food rather than scavenging, spotted hyenas take down wildebeest and zebra in coordinated pack hunts. Their distinctive whooping and laughing calls communicate individual identity, social status, and threats over long distances between clan members in matriarchal societies of up to 80 individuals. Uniquely, females are larger, more aggressive, and dominant over males, with elevated testosterone levels and pseudo-penises making gender difficult to distinguish." },
    { "category": "animals", "title": "Chimpanzee", "text": "Chimpanzees are our closest living relatives sharing 98.8% of human DNA and displaying remarkable intelligence including sophisticated tool use, cultural transmission across generations, and even rudimentary language comprehension. These highly social apes live in African forest communities of 20-150 individuals with complex Machiavellian politics, territorial warfare between groups, strategic alliances, and touching reconciliation behaviors including hugging and kissing. They fashion and modify stick tools for termite fishing, use stones as hammers and anvils to crack nuts, create spears for hunting bushbabies, and cooperatively hunt colobus monkeys. Chimps demonstrate self-awareness, empathy, deception, and mourning for deceased community members." },
    { "category": "animals", "title": "Orangutan", "text": "Orangutans are red-haired great apes with remarkably long arms spanning over 2.2 meters, spending 90% of their lives in Southeast Asian rainforest canopies rarely descending to ground. These predominantly solitary intelligent primates demonstrate advanced problem-solving rivaling chimpanzees, sophisticated tool use including fashioning rain hats from leaves and using sticks to extract insects, and deliberate teaching behaviors transmitting knowledge to offspring. Males develop dramatic cheek pads called flanges signaling dominance. Critically endangered, their populations have declined over 80% due to catastrophic habitat destruction from palm oil plantations, illegal pet trade, and forest fires." },
    { "category": "animals", "title": "Leopard", "text": "Leopards are remarkably adaptable spotted cats with powerful muscular builds capable of dragging prey three times their own weight vertically into trees, avoiding scavengers like hyenas and lions while creating larders. These solitary primarily nocturnal hunters have the widest geographic range of all big cats, thriving across sub-Saharan Africa, Northeast Africa, Central Asia, India, and China in diverse habitats from rainforests to deserts. Their distinctive rosette-spotted camouflage provides perfect concealment in dappled forest light and grasslands. Leopards are exceptional climbers with retractable claws, can leap 6 meters horizontally and 3 meters vertically, and are strong swimmers unlike most cats." },
    { "category": "animals", "title": "Jaguar", "text": "Jaguars are powerfully built robust spotted cats from Central and South American rainforests possessing the strongest bite force of all cats at over 2,000 PSI, powerful enough to crush turtle shells, pierce caiman skulls, and even crack open armadillo armor. These apex predators are exceptional swimmers unlike most felines, hunting fish, caimans, capybaras, and anacondas in rivers and swampy wetlands. Uniquely among big cats, jaguars kill with specialized hunting technique of piercing directly through skulls or cervical vertebrae with canines rather than suffocating prey with throat bites. Their name derives from indigenous word yaguara meaning he who kills with one leap." },
    { "category": "animals", "title": "Cougar", "text": "Cougars are large solitary cats known by over 40 names including mountain lion, puma, panther, and catamount, adapted to remarkably diverse American habitats from Canadian forests to Patagonian mountains, deserts to tropical rainforests. These powerful ambush predators can leap 6 meters vertically and 12 meters horizontally, sprint up to 80 kilometers per hour in short explosive bursts, and kill prey up to seven times their weight including deer, elk, and occasionally moose. Males maintain vast exclusive territories spanning up to 1,000 square kilometers, marked through scrapes and scent. Cougars hold the Guinness record for animal with most names in English." },
    { "category": "animals", "title": "Lynx", "text": "Lynx are medium-sized wild cats with distinctive black ear tufts enhancing hearing, large padded furry paws acting as natural snowshoes distributing weight for walking on deep snow, and dense silvery fur insulating against extreme cold. These solitary specialized hunters depend almost exclusively on snowshoe hares, their populations cycling synchronously in famous predator-prey oscillations through boreal forests. Exceptional hearing detects prey under snow while large eyes provide superior night vision. Their elusive secretive nature, low population density, and preference for dense remote forests make them extremely rarely seen despite widespread northern hemisphere distribution across Scandinavia, Russia, Canada, and Alaska." },
    { "category": "animals", "title": "Badger", "text": "Badgers are powerfully built muscular burrowing mammals with distinctive black and white facial stripes, creating extensive underground sett tunnel systems with multiple chambers, entrances, and generations of family occupation spanning centuries. These fierce omnivores possess incredibly strong forelimbs and long claws for digging, hunting rodents, earthworms, insects, and consuming plant roots, fruits, and honey. Despite stocky low-slung appearance weighing up to 12 kilograms, badgers defend themselves with surprising ferocity against much larger predators including bears and wolves, using tough loose skin, powerful jaws, and aggressive charges. European badgers are highly social living in clan groups, while American badgers are solitary hunters." },
    { "category": "animals", "title": "Weasel", "text": "Weasels are tiny elongated carnivores measuring just 15-25 centimeters yet displaying surprising ferocity, capable of killing rabbits and other prey over ten times their body weight through persistent neck bites. These incredibly agile hunters pursue prey into narrow burrows and through snow tunnels using slender ultra-flexible bodies, lightning-quick reflexes, and relentless energy requiring them to eat 40% of their body weight daily. Their rich brown summer coats molt to pure white winter fur (ermine) providing perfect camouflage in snowy landscapes. Despite being smallest carnivores, weasels fearlessly defend territories and perform hypnotic war dances mesmerizing prey before attacking." },
    { "category": "animals", "title": "Beaver", "text": "Beavers are industrious ecosystem engineers building complex dams up to 850 meters long and lodges from trees they fell with powerful self-sharpening orange incisors that never stop growing. These large aquatic rodents weighing up to 32 kilograms create crucial wetland ecosystems benefiting countless species while their dense waterproof fur (23,000 hairs per square centimeter), webbed hind feet, and transparent nictitating membranes enable skilled underwater swimming and construction. Monogamous beaver families work cooperatively maintaining dams, storing underwater food caches for winter, and communicating through tail slaps warning of danger. Their engineering dramatically alters landscapes, creating ponds that prevent erosion and filter water." },
    { "category": "animals", "title": "Platypus", "text": "Platypuses are extraordinarily bizarre egg-laying monotreme mammals from Australia combining duck-like bills, beaver tails, otter feet with webbing, and venomous ankle spurs possessed only by males in remarkably unique evolutionary package. These semi-aquatic oddities hunt underwater with eyes and ears closed, using 40,000 electroreceptors in sensitive bills detecting prey electrical muscle fields in murky riverbeds. Males produce venom through ankle spurs during breeding season causing excruciating pain to rivals, highly unusual among mammals. When first discovered, European scientists thought the preserved specimen was an elaborate hoax with sewn-together parts. Platypuses have no stomach and lack teeth as adults." },
    { "category": "animals", "title": "Echidna", "text": "Echidnas are spiny egg-laying monotreme mammals from Australia and New Guinea, one of only two surviving egg-laying mammal groups alongside platypuses, representing ancient mammalian lineage. These specialized ant and termite eaters use remarkably long sticky tongues extending up to 18 centimeters to reach deep into nests, detecting prey through electroreceptors concentrated in elongated highly sensitive snouts. Their bodies are covered in sharp defensive spines (modified hairs) providing excellent protection, allowing them to curl into impenetrable balls when threatened by dingoes and eagles. Echidnas have surprisingly large brains, low body temperatures, and can live over 50 years in the wild." },
    { "category": "animals", "title": "Armadillo", "text": "Armadillos are unique armored mammals covered in tough bony plated shells called carapaces made of overlapping osteoderms, with three-banded species rolling into completely impenetrable balls when threatened. These insectivores dig extensive elaborate burrow networks up to 5 meters deep with powerful claws, remaining primarily nocturnal while hunting beetles, ants, termites, and small vertebrates using excellent sense of smell. The nine-banded armadillo is the only species naturally found in North America, expanding range northward. Remarkably, female nine-banded armadillos always give birth to identical quadruplets from a single fertilized egg. They can hold their breath for 6 minutes and walk underwater across streambeds." },
    { "category": "animals", "title": "Porcupine", "text": "Porcupines are large slow-moving rodents covered in approximately 30,000 sharp barbed detachable quills (modified guard hairs) that easily embed in attacking predators, causing increasingly painful injuries as microscopic backward-facing barbs work deeper into tissue. These herbivores climb trees expertly despite their considerable bulk up to 18 kilograms, using strong claws to eat bark, leaves, twigs, and fruits. Contrary to popular myth, porcupines cannot shoot or throw quills but instead back rapidly into threats while raising and rattling spines as warning. New World porcupines are skilled climbers while Old World species are primarily terrestrial. Their quills have natural antibiotic properties." },
    { "category": "animals", "title": "Hedgehog", "text": "Hedgehogs are small nocturnal mammals covered in approximately 5,000-7,000 short sharp spines, curling into impenetrably tight spiny balls using powerful circular muscles for defense against foxes and badgers. These beneficial insectivores shuffle through gardens and hedgerows eating beetles, slugs, snails, earthworms, and occasional small vertebrates, with excellent hearing and smell compensating for poor eyesight. Their distinctive spines are actually modified hollow hairs made of lightweight keratin, each lasting about a year before being replaced. Hedgehogs are immune to many snake venoms, can survive falls from significant heights due to spiny cushioning, and self-anoint with frothy saliva for unknown reasons." },
    { "category": "animals", "title": "Mole", "text": "Moles are highly specialized subterranean mammals with powerful spade-like front paws and extra thumb bones for digging, creating extensive underground tunnel networks spanning hundreds of meters while relentlessly hunting earthworms consuming up to 100% of their body weight daily. These nearly blind animals with tiny non-functional eyes covered by skin navigate using extremely sensitive hairless snouts called Eimer organs detecting minute vibrations, electrical fields, and smells in total darkness. Their unique velvet-like fur with no directional grain can lie flat in any direction allowing easy backward movement through narrow tunnels. Moles are solitary and highly territorial, patrolling tunnel systems and storing paralyzed earthworms in underground larders." },
    { "category": "animals", "title": "Raccoon", "text": "Raccoons are highly intelligent masked bandits with remarkably dexterous front paws containing four to five times more sensory receptors than most mammals, capable of opening containers, turning doorknobs, unlocking latches, and manipulating objects with near-human precision. These extraordinarily adaptable omnivores thrive in diverse habitats from forests to urban environments, raiding garbage cans using exceptional problem-solving abilities and memory lasting years. Their distinctive habit of dunking and washing food in water stems from tactile dousing behavior amplifying touch sensitivity for examining food, evolved from catching crayfish and frogs. Raccoons are primarily nocturnal with excellent night vision, can run 24 kilometers per hour, and survive nearly anywhere humans live." },
    { "category": "animals", "title": "Skunk", "text": "Skunks are distinctive black and white striped mammals defending themselves by accurately spraying nauseating sulfur-based thiols musk from twin anal glands up to 5 meters away with remarkable precision, causing temporary blindness and overwhelming stench detectable by humans from 5 kilometers downwind. These primarily nocturnal omnivores eat insects, grubs, small rodents, eggs, fruits, and garbage with relatively poor eyesight but excellent sense of smell. Their bold high-contrast warning coloration (aposematism) advertises potent chemical defense to potential predators, usually preceded by warning displays including tail raising, stomping, and handstands. Skunks can spray five to six times before depleting musk reserves requiring 10 days to replenish." },
    { "category": "animals", "title": "Meerkat", "text": "Meerkats are highly social cooperative mongooses forming tight-knit mobs of 20-50 individuals in African Kalahari desert, taking organized shifts standing upright sentry on hind legs scanning skies and horizons while others forage for insects, scorpions, and small vertebrates. These remarkably vocal animals use complex alarm call systems with different sounds communicating specific predator types (eagles, jackals, snakes) including urgency level and distance. Extensive underground burrow networks with multiple bolt-hole entrances, chambers, and tunnels protect colonies from extreme desert heat and predators. Meerkats demonstrate teaching behavior, babysitting cooperation, and mob dominance hierarchies with alpha pairs producing most offspring." },
    { "category": "animals", "title": "Prairie Dog", "text": "Prairie dogs are highly social burrowing rodents creating vast underground colonial towns called coteries spanning hundreds of acres with sophisticated tunnel systems including designated nurseries, sleeping chambers, listening posts, and toilet areas. These gregarious herbivores communicate through one of the most complex animal languages discovered, with diverse vocal calls conveying specific information including predator type, size, color, and approach speed, while greeting each other through touching noses in identification kisses. Their crucial keystone ecological role aerating and fertilizing soil, creating habitat for over 150 species, and serving as prey for numerous predators makes them essential to grassland ecosystem health despite rancher conflicts." },
    { "category": "animals", "title": "Capybara", "text": "Capybaras are the world's largest living rodents weighing up to 65 kilograms and measuring 1.3 meters long, living in highly social groups of 10-20 individuals near South American rivers, wetlands, and flooded savannas. These gentle giant semi-aquatic herbivores graze on grasses and aquatic plants up to 3.5 kilograms daily, using partially webbed feet for excellent swimming, diving underwater for up to 5 minutes to escape predators. Their remarkably calm docile temperament allows peaceful coexistence with diverse animals including birds perching on their backs eating parasites, and caimans sharing waterways. Capybaras are crepuscular, highly vocal with purrs and barks, and require water access for regulating body temperature and mating." },
    { "category": "animals", "title": "Alpaca", "text": "Alpacas are domesticated South American camelids bred for over 6,000 years primarily for luxuriously soft hypoallergenic wool (fleece) coming in 22 natural colors and finer than cashmere, standing smaller and gentler than llamas at 90 centimeters tall. These social herd animals communicate through complex body language, gentle humming vocalizations expressing contentment or concern, and occasionally spitting foul-smelling stomach contents when annoyed or establishing dominance hierarchy. Their soft padded two-toed feet cause minimal ground impact and erosion making them environmentally friendly grazers. Alpacas are intelligent, trainable, naturally curious, and live 15-20 years providing annual fiber harvests." },
    { "category": "animals", "title": "Llama", "text": "Llamas are large domesticated South American pack animals used for over 5,000 years, carrying loads up to 30% of body weight (45 kilograms) across rugged Andean mountain trails at high altitudes where other pack animals struggle. These highly intelligent social camelids standing 1.8 meters tall spit accurately targeted foul-smelling partially digested stomach contents at threats or to establish dominance hierarchies within herds. Their coarse wool provides warmth and sturdy fibers, while nitrogen-rich droppings make excellent odorless fertilizer for crops. Llamas are alert guard animals protecting livestock from predators, communicate through ear positions and humming, and can live 20-30 years." },
    { "category": "animals", "title": "Camel", "text": "Camels are remarkably desert-adapted mammals with distinctive fatty humps (one in dromedaries, two in Bactrians) storing up to 36 kilograms of fat converted to energy and water, enabling survival for weeks without drinking while traveling vast distances across scorching arid landscapes. These large ungulates can drink 135 liters in just 13 minutes when water available, storing it in bloodstream and body tissues, not humps. Their numerous adaptations include thick double-row eyelashes, closeable slit nostrils, and wide spreading feet preventing sand sinking, while body temperature fluctuates 6°C minimizing water loss through sweating. Camels can carry 200-kilogram loads, travel 40 kilometers daily, and withstand 50°C heat." },
    { "category": "animals", "title": "Reindeer", "text": "Reindeer (caribou in North America) are Arctic and subarctic deer unique among deer species where both males and females grow antlers, migrating up to 5,000 kilometers annually across tundra in massive herds numbering hundreds of thousands. These remarkably cold-adapted herbivores possess hollow air-filled hair providing exceptional insulation and buoyancy for swimming, while specialized clicking tendons make distinctive walking sounds helping herds stay together in blizzards. Their wide hooves spread for walking on snow and contract for swimming. Domesticated for over 3,000 years by indigenous Sami, Nenets, and other peoples for transport, milk, meat, hides, and cultural significance. Reindeer can see ultraviolet light helping them spot predators and lichens in snow." },
    { "category": "animals", "title": "Bison", "text": "Bisons are massive North American grazers with thick shaggy coats and large horned heads, once numbering an estimated 60 million before catastrophic near-extinction from systematic overhunting reducing populations to fewer than 1,000 by 1890s. These powerful herbivores weighing up to 1,000 kilograms can run at surprising speeds of 55 kilometers per hour, jump nearly 2 meters high, and swim across rivers despite their imposing bulk. Conservation efforts led by Teddy Roosevelt and others successfully restored populations to over 500,000 today, though genetically pure wild herds remain limited. Bison are North America's largest land mammals, with bulls reaching 2 meters tall at shoulder, and play crucial ecosystem roles through grazing patterns." },
    { "category": "animals", "title": "Yak", "text": "Yaks are long-haired shaggy bovines from Himalayan plateau regions perfectly adapted to extreme high-altitude life above 3,000-5,500 meters with enlarged lungs containing more red blood cells, larger hearts, and lack of true sweat glands. These remarkably sure-footed animals weighing up to 1,000 kilograms have provided essential transport, rich milk (6.5% fat), meat, leather, and warm wool to Tibetan and Mongolian nomadic peoples for over 4,000 years. Their extremely thick double-layered coats with long guard hairs and dense undercoats, ability to efficiently metabolize scarce oxygen at altitude, and resistance to freezing temperatures down to -40°C make them perfectly suited mountain dwellers where other livestock cannot survive." },
    { "category": "animals", "title": "Buffalo", "text": "Buffalos are large powerful bovines with impressive curved horns spanning up to 1.5 meters, living in African savannas (Cape buffalo) and Asian wetlands (water buffalo), regularly wallowing in mud for thermoregulation and parasite control. These massive herbivores weighing up to 900 kilograms form protective herds providing safety through numbers against lion, crocodile, and leopard predators, with African buffalo being notoriously dangerous to humans when threatened. Water buffalo have been domesticated for over 5,000 years for plowing flooded rice paddies, producing rich milk for mozzarella cheese, and providing meat and leather. Wild African Cape buffalo are unpredictable, demonstrating coordinated herd defense and remembering grudges against specific threats." },
    { "category": "animals", "title": "Antelope", "text": "Antelopes are swift graceful herbivores with permanent unbranched horns (unlike deer antlers), comprising over 91 diverse species adapted to African and Asian grasslands, savannas, and deserts ranging from tiny 3-kilogram dik-diks to 950-kilogram giant elands. These prey animals rely on exceptional speed up to 95 kilometers per hour, agility with zigzag evasion maneuvers, and keen senses including excellent peripheral vision to detect and outrun predators like cheetahs, lions, and hyenas. Their herding behavior creates safety through collective vigilance, predator confusion, and dilution effect. Many species perform spectacular stotting leaps signaling fitness to predators, while horns are used in territorial disputes and defense." },
    { "category": "animals", "title": "Gazelle", "text": "Gazelles are elegant slender antelopes capable of reaching sustained speeds of 96 kilometers per hour with bursts up to 100 kilometers per hour, performing distinctive pronking or stotting leaps up to 2 meters high signaling fitness and alertness to predators like cheetahs. These remarkably desert-adapted herbivores can survive indefinitely without drinking water, obtaining all moisture from succulent plants and dew. Their graceful lyre-shaped horns, tan sandy coats, and white rumps flashing while running provide camouflage in savanna grasslands while communicating alarm. Gazelles have exceptional vision detecting movement from great distances, are browsers feeding on leaves and shoots, and several species are critically endangered." }
]